{
  "Technologies": ["Think", "Design", "Code", "Test", "Deploy", "Refactor", "Repeat"],
  "Person": {
    "Name": "Mauricio Cardozo",
    "Role": "Full Stack Engineer",
    "SmallDescription": "Software engineer focused on building robust, scalable solutions — driven by clarity, simplicity, and long-term maintainability.",
    "LongDescription": "I’m a Full Stack Engineer with over 3 years of experience building scalable and maintainable web applications using .NET and Angular. I thrive in dynamic environments where I can solve complex problems and contribute to impactful solutions. I value clean code, strong architecture, and clear communication — always aiming to deliver software that is robust, user-focused, and aligned with business goals. In addition to my technical skills, I enjoy mentoring others, learning continuously, and taking ownership of the development lifecycle from planning to deployment. I’m also developing my knowledge in cybersecurity, as I intend to gradually move my career in that direction in the coming years."
  },
  "Career": {
  "Description": "I began my studies at Instituto Superior de Informática (ESI Buceo), where I received my technical education in IT and built a solid foundation in programming and systems. Later, I continued my academic path at Universidad ORT Uruguay, where I pursued a degree as an IT Analyst and Programmer, and I am currently completing a Cybersecurity Analyst program. This combination has allowed me to strengthen both my software development and secure systems knowledge. Since December 2021, I have been working at Urudata Software as a Full Stack Engineer, contributing to the design, development, and maintenance of scalable web applications with a focus on clean architecture, code quality, and system security.",
  "Experiences": [
    {
      "Company": "Urudata Software",
      "Position": "Full Stack Engineer / Team Leader",
      "StartDate": "2021",
      "EndDate": "Present",
      "Description": "Design, develop, and maintain scalable web applications using .NET, Angular, and SQL Server, ensuring code quality, performance, and security. Collaborate closely with product owners and stakeholders to deliver solutions aligned with business needs while leading and mentoring a small team of developers.",
      "Tasks": [
        "Design and implement RESTful APIs and integrations with third-party services.",
        "Lead and support a development team through code reviews, technical guidance, and problem-solving.",
        "Optimize frontend and backend performance, scalability, and security.",
        "Collaborate with stakeholders to define requirements and deliver robust solutions.",
        "Develop responsive and user-friendly interfaces using Angular and modern web technologies."
      ],
      "Technologies": ["Angular", ".NET", "SQL Server", ".NET Framework", "ABP Framework", "Azure DevOps", "C#"]
    }
  ]
  }
}

